{
    "title_screen": "Samuel Varano",
    "about_me": "About me",
    "it_works": "IT Work",
    "experience": "Experience",
    "contact_information": "Contact Information",
    "personal_presentation_p1": "Hi, I'm Samuel.",
    "personal_presentation_p2": "I consider myself a sincere, serious, flexible and precise person, I like to learn new things and new cultures. I love working in contact with people but I don't disdain working alone on the computer. In my spare time I play sports, I value my health and fitness and when I can I love to travel. I also have created a brand called Varano Brand where I express my creativity.",
    "personal_presentation_p3": "I graduated with 80/100 at the Leonardo Da Vinci Technical Institute in Florence as a computer expert in 2020 and since 2025 I'm a student at the University of Pisa in the Computer Science course. During my work experience I had the opportunity to continue a continuous personal growth by increasing my passions and refining my experience which, day after day, increases. I am always looking for new challenges and opportunities to improve my skills and contribute to interesting projects.",
    "personal_presentation_p4": "I have a B and A2 license, I have a car and I am available for travel, even outside Florence.",
    "languages": "Languages",
    "italian": "Italian (Native)",
    "english": "English (B2)",
    "spanish": "Spanish (A2)",
    "education": "Education",
    "bachelor_computer_science": "Bachelor's in Computer Science",
    "university_of_pisa": "University of Pisa",
    "years_2025_ongoing": "2025 - Ongoing",
    "education_p1": "I'm a working student and I decided to start this walk to improve myself and to build a strong knowledge in Computer Science. I'm at the first year at the moment and even with some difficulties I don't disown my choice.",
    "degree_computer_science": "Degree in Computer Science",
    "iti_leonardo_da_vinci": "ITI Leonardo Da Vinci",
    "grade": "Grade: 80/100",
    "education_p2": "I studied programming languages html, css, c++, c, Java, php, Query and MySQL. In addition to programming languages I have acquired skills in the system field and in computer logic. I have also had the opportunity to learn how to assemble computers and edit videos and photos.",
    "it_work_projects": "IT Work & Projects",
    "github_profile": "GitHub Profile",
    "check_repositories": "Check out my code repositories and open-source contributions:",
    "technical_skills": "Technical Skills",
    "main_programming_languages": "Main Programming Languages",
    "dart": "Dart",
    "java": "Java",
    "javascript": "JavaScript",
    "php": "Php",
    "html5": "HTML5",
    "css": "CSS",
    "bash": "Bash",
    "frameworks_libraries": "Frameworks & Libraries",
    "flutter": "Flutter",
    "react_js": "React JS",
    "ionic": "IONIC",
    "spring": "Spring",
    "tools_technologies": "Tools & Technologies",
    "android_studio": "Android Studio",
    "git_technologies": "Git technologies",
    "vs_code": "VS Code",
    "wordpress": "Wordpress",
    "agile": "AGILE",
    "personal_projects": "Personal Projects",
    "fit_tracker": "FIT TRACKER (on going)",
    "fit_tracker_desc": "Smartphone app for gym & wellness activity",
    "documenti": "Documenti",
    "draw_io": "Draw.io",
    "under_works": "UNDER WORKS",
    "my_curriculum_vitae": "MyCurriculumVitaeSV",
    "curriculum_desc": "Small project about my Curriculum like a site",
    "certifications": "Certifications",
    "ionic_react_cert": "Ionic React: Cross-Platform Mobile Development with Ionic",
    "udemy": "Udemy",
    "cert_date_may_2023": "May 2023",
    "ionic_cert_desc": "Certificate of an Udemy course in Ionic React to learn Mobile Development with Ionic. ID: UC-ade73744-93f4-4c87-9fb6-c1e6a9e48319",
    "business_english": "Business English Certificate",
    "adecco": "Adecco",
    "cert_date_july_2024": "July 2024",
    "digital_transformation": "Digital Transformation Certificate",
    "cert_date_september_2024": "September 2024",
    "work_experience": "Work Experience",
    "software_developer": "Software Developer",
    "advanced_microwave": "Advanced Microwave Engeneering S.R.L.",
    "experience_date_06_2024": "06/2024 - Present",
    "exp_software_dev_desc": "Within the company my role is as a software developer and tester. Specifically, I have contributed to make changes and updates but also to start building applications aimed at safety at work. In fact, the common goal of the company is to develop systems for worker safety within workplaces such as construction sites or large warehouses.",
    "exp_technical_part": "Technical part:",
    "exp_software_dev_technical": "Software development with Java and Flutter and use of Android Studio for developing and modifying applications in android. Testing phase in Java using NetBeans testing environment.",
    "jr_software_developer": "Jr Software Developer",
    "softec_spa": "Softec S.P.A.",
    "experience_date_09_2023": "09/2023 - 02/2024",
    "exp_internship_learned": "During the internship I learned:",
    "exp_problem_solving": "Problem Solving method for solving queries.",
    "exp_new_languages": "New programming languages such as PHP and WordPress with in-depth study of JavaScript, HTML5 and CSS.",
    "exp_team_working": "Team Working skills and ability to work under pressure.",
    "exp_smart_working": "Smart-Working Aptitude.",
    "jr_frontend_developer": "Jr Front-End Developer",
    "omnia_group": "Omnia Group S.R.L.",
    "experience_date_11_2022": "11/2022 - 05/2023",
    "exp_frontend_desc": "Within the internship I had the opportunity to interface and to contributate with the development of user interfaces and web apps on the Front-End side, going to build all the part of the user registration forms and differentiating by basic user and business user; I also developed the post login user interfaces differentiating them mainly in two parts: a first one that corresponds to the basic user side and is the customer interface, a second one that corresponds to the business side and is the interface dedicated to companies. Also, although in a minor way, I learned the implementation of a smart contract and its use so that it can be made usable within the developed web app.",
    "exp_documentation": "I also got to learn how to perform some documentation steps related to a project such as making sequence diagrams, using the UML, and writing a description for certain parts of the project.",
    "exp_additional_skills": "In addition to programming languages I got to improve personal skills such as those related to team-working and smart-working, as well as character skills such as concentration, compliance, seriousness in work projects and more generally a personal growth and my level of English, written and oral.",
    "exp_skills_list": "Skills: Front-end Development · Web Design · Team Working· CSS · HTML · Sequence diagram · Uml · Web Development · Typescript · Solidity · Ionic · React.js · JavaScript",
    "additional_experience": "Additional Experience",
    "receptionist": "Receptionist",
    "hotel_mia_cara": "Hotel Mia Cara",
    "experience_date_03_2024": "[03/2024 - 06/2024] - Hotel Mia Cara",
    "exp_receptionist_desc": "I've carried out the receptionist in a hotel in centre of Florence, mainly working two shifts, afternoon and night. Work carried out during a course in JAVA to improve my knowledge, course hosted by Adecco.",
    "varano-description": "Varano Brand is more than just a brand: it is a visual identity that combines style, research, and character. Specializing in the creation of garments and products that represent Varano in every possible way, we focus on quality, authenticity, and designs that leave their mark, always keeping environmental sustainability and ecology at the forefront. We are where creativity meets nature, we are Varano Brand."
}