{
    "title_screen": "Samuel Varano",
    "about_me": "Sobre mí",
    "it_works": "Trabajos IT",
    "experience": "Experiencias",
    "contact_information": "Información de contacto",
    "personal_presentation_p1": "¡Hola! Mi nombre es Samuel.",
    "personal_presentation_p2": "Me considero una persona sincera, seria, flexible y precisa. Me encanta aprender cosas nuevas y conocer nuevas culturas. Me gusta trabajar en contacto con las personas, pero también disfruto trabajando solo en la computadora. En mi tiempo libre practico deporte, cuido mucho mi salud y forma física, y cuando puedo me encanta viajar. También he creado una marca llamada Varano Brand donde expreso mi creatividad.",
    "personal_presentation_p3": "Me gradué con 80/100 en el Instituto Técnico Leonardo Da Vinci de Florencia como experto informático en 2020 y desde 2025 soy estudiante en la Universidad de Pisa en la carrera de Informática. Durante mi experiencia laboral he tenido la oportunidad de continuar un crecimiento personal constante, aumentando mis pasiones y perfeccionando mi experiencia que, día tras día, aumenta. Siempre busco nuevos desafíos y oportunidades para mejorar mis competencias y contribuir a proyectos interesantes.",
    "personal_presentation_p4": "Tengo licencia de conducir categoría B y A2, tengo un automóvil y estoy disponible para viajar, incluso fuera de Florencia.",
    "languages": "Idiomas",
    "italian": "Italiano (Lengua materna)",
    "english": "Inglés (B2)",
    "spanish": "Español (A2)",
    "education": "Educación",
    "bachelor_computer_science": "Licenciatura en Informática",
    "university_of_pisa": "Universidad de Pisa",
    "years_2025_ongoing": "2025 - En curso",
    "education_p1": "Soy estudiante trabajador y decidí emprender este camino para mejorarme a mí mismo y adquirir un conocimiento sólido en el campo de la informática. Actualmente estoy en el primer año y, a pesar de algunas dificultades, no me arrepiento de mi elección.",
    "degree_computer_science": "Diploma de Perito Informático",
    "iti_leonardo_da_vinci": "ITI Leonardo Da Vinci",
    "grade": "Calificación: 80/100",
    "education_p2": "Estudié lenguajes de programación como HTML, CSS, C++, C, Java, PHP, Query y MySQL. Además de lenguajes de programación, adquirí competencias en sistemas e informática lógica. También tuve la oportunidad de aprender a ensamblar computadoras y a editar videos y fotos.",
    "it_work_projects": "Trabajos IT y Proyectos",
    "github_profile": "Perfil GitHub",
    "check_repositories": "Echa un vistazo a mis repositorios de código y mis contribuciones de código abierto:",
    "technical_skills": "Competencias Técnicas",
    "main_programming_languages": "Lenguajes de programación principales",
    "dart": "Dart",
    "java": "Java",
    "javascript": "JavaScript",
    "php": "Php",
    "html5": "HTML5",
    "css": "CSS",
    "bash": "Bash",
    "frameworks_libraries": "Frameworks y Librerías",
    "flutter": "Flutter",
    "react_js": "React JS",
    "ionic": "IONIC",
    "spring": "Spring",
    "tools_technologies": "Herramientas y Tecnologías",
    "android_studio": "Android Studio",
    "git_technologies": "Tecnologías Git",
    "vs_code": "VS Code",
    "wordpress": "Wordpress",
    "agile": "AGILE",
    "personal_projects": "Proyectos personales",
    "fit_tracker": "FIT TRACKER (en curso)",
    "fit_tracker_desc": "Aplicación para smartphone para gimnasio y actividades de bienestar",
    "documenti": "Documentos",
    "draw_io": "Draw.io",
    "under_works": "TRABAJOS EN PROGRESO",
    "my_curriculum_vitae": "MyCurriculumVitaeSV",
    "curriculum_desc": "Pequeño proyecto que muestra mi CV como un sitio web",
    "certifications": "Certificaciones",
    "ionic_react_cert": "Ionic React: Desarrollo de aplicaciones móviles multiplataforma con Ionic",
    "udemy": "Udemy",
    "cert_date_may_2023": "Mayo 2023",
    "ionic_cert_desc": "Certificado de un curso de Udemy sobre Ionic React para aprender desarrollo móvil con Ionic. ID: UC-ade73744-93f4-4c87-9fb6-c1e6a9e48319",
    "business_english": "Certificado de Business English",
    "adecco": "Adecco",
    "cert_date_july_2024": "Julio 2024",
    "digital_transformation": "Certificado de Transformación Digital",
    "cert_date_september_2024": "Septiembre 2024",
    "work_experience": "Experiencia Laboral",
    "software_developer": "Desarrollador de Software",
    "advanced_microwave": "Advanced Microwave Engeneering S.R.L.",
    "experience_date_06_2024": "06/2024 - Presente",
    "exp_software_dev_desc": "Dentro de la empresa desempeño el rol de desarrollador y evaluador de software. Específicamente, he contribuido a realizar cambios y actualizaciones, así como a iniciar la creación de aplicaciones destinadas a la seguridad en el trabajo. De hecho, el objetivo común de la empresa es desarrollar sistemas para la seguridad de los trabajadores en lugares de trabajo como sitios de construcción o grandes almacenes.",
    "exp_technical_part": "Parte técnica:",
    "exp_software_dev_technical": "Desarrollo de software con Java y Flutter y uso de Android Studio para el desarrollo y modificación de aplicaciones Android. Fase de prueba en Java utilizando el entorno de prueba NetBeans.",
    "jr_software_developer": "Desarrollador de Software Jr",
    "softec_spa": "Softec S.P.A.",
    "experience_date_09_2023": "09/2023 - 02/2024",
    "exp_internship_learned": "Durante la pasantía aprendí:",
    "exp_problem_solving": "Métodos de resolución de problemas para resolver consultas.",
    "exp_new_languages": "Nuevos lenguajes de programación como PHP y WordPress con estudio profundo de JavaScript, HTML5 y CSS.",
    "exp_team_working": "Capacidad para trabajar en equipo y trabajar bajo presión.",
    "exp_smart_working": "Actitud hacia el Smart-Working",
    "jr_frontend_developer": "Desarrollador Front-End Jr",
    "omnia_group": "Omnia Group S.R.L.",
    "experience_date_11_2022": "11/2022 - 05/2023",
    "exp_frontend_desc": "Durante la pasantía tuve la oportunidad de interactuar y contribuir al desarrollo de interfaces de usuario y aplicaciones web en el lado Front-End, ocupándome de la creación de todos los módulos de registro de usuarios y distinguiendo entre usuarios básicos y usuarios empresariales. También desarrollé interfaces de usuario posteriores al inicio de sesión, diferenciándolas principalmente en dos partes: una primera parte correspondiente al lado del usuario básico que es la interfaz del cliente, y una segunda parte correspondiente al lado empresarial que es la interfaz dedicada a las empresas. Además, aunque en menor medida, aprendí la implementación de un contrato inteligente y su uso para que pueda ser utilizable dentro de la aplicación web desarrollada.",
    "exp_documentation": "También aprendí cómo realizar algunas operaciones de documentación relacionadas con un proyecto, como la creación de diagramas de secuencia, el uso de UML y la redacción de una descripción de algunas partes del proyecto.",
    "exp_additional_skills": "Además de lenguajes de programación, pude mejorar mis competencias personales, como las relacionadas con el trabajo en equipo y el smart working, así como mis habilidades de carácter, como la concentración, el cumplimiento, la seriedad en proyectos laborales y, en general, mi crecimiento personal y mi nivel de inglés escrito y oral.",
    "exp_skills_list": "Habilidades: Desarrollo Front-end · Diseño Web · Trabajo en Equipo · CSS · HTML · Diagrama de secuencia · Uml · Desarrollo Web · Typescript · Solidity · Ionic · React.js · JavaScript",
    "additional_experience": "Experiencias adicionales",
    "receptionist": "Recepcionista",
    "hotel_mia_cara": "Hotel Mia Cara",
    "experience_date_03_2024": "[03/2024 - 06/2024] - Hotel Mia Cara",
    "exp_receptionist_desc": "Desempeñé el trabajo de recepcionista en un hotel en el centro de Florencia, trabajando principalmente en dos turnos, vespertino y nocturno. Trabajo realizado durante un curso de JAVA para mejorar mis conocimientos, curso organizado por Adecco.",
    "varano-description": "Varano Brand es más que una marca: es una identidad visual que combina estilo, investigación y carácter. Especializados en la creación de prendas y productos que cuentan la historia de Varano en todos los lugares posibles, apostamos por la calidad, la autenticidad y un diseño que deja huella, manteniendo siempre como eje central la sostenibilidad medioambiental y la ecología. Estamos donde la creatividad se encuentra con la naturaleza, somos Varano Brand."
}