{
    "title_screen": "Samuel Varano",
    "about_me": "Chi sono",
    "it_works": "Lavori IT",
    "experience": "Esperienze",
    "hobby": "Hobby",
    "contact_information": "Informazioni di contatto",
    "personal_presentation_p1": "Ciao! Mi chiamo Samuel.",
    "personal_presentation_p2": "Mi considero una persona sincera, seria, flessibile e precisa, mi piace imparare cose nuove e conoscere nuove culture. Amo lavorare a contatto con le persone, ma non disdegno lavorare da solo al computer. Nel tempo libero pratico sport, tengo molto alla mia salute e alla mia forma fisica e, quando posso, amo viaggiare. Ho anche creato un marchio chiamato Varano Brand dove esprimo la mia creatività.",
    "personal_presentation_p3": "Mi sono diplomato con 80/100 all'Istituto Tecnico Leonardo Da Vinci di Firenze come esperto informatico nel 2020 e dal 2025 sono studente all'Università di Pisa nel corso di Informatica. Durante la mia esperienza lavorativa ho avuto l'opportunità di continuare una crescita personale continua aumentando le mie passioni e affinando la mia esperienza che, giorno dopo giorno, aumenta. Sono sempre alla ricerca di nuove sfide e opportunità per migliorare le mie competenze e contribuire a progetti interessanti.",
    "personal_presentation_p4": "Ho la patente B e A2, ho un'auto e sono disponibile a viaggiare, anche fuori Firenze.",
    "languages": "Linguaggi",
    "italian": "Italiano (Madrelingua)",
    "english": "Inglese (B2)",
    "spanish": "Spagnolo (A2)",
    "education": "Educazione",
    "bachelor_computer_science": "Laurea in Informatica",
    "university_of_pisa": "Università di Pisa",
    "years_2025_ongoing": "2025 - In corso",
    "education_p1": "Sono uno studente lavoratore e ho deciso di intraprendere questo percorso per migliorare me stesso e acquisire una solida conoscenza nell'ambito dell'informatica. Al momento sono al primo anno e, nonostante alcune difficoltà, non rinnego la mia scelta.",
    "degree_computer_science": "Diploma di Perito Informatico",
    "iti_leonardo_da_vinci": "ITI Leonardo Da Vinci",
    "grade": "Voto: 80/100",
    "education_p2": "Ho studiato i linguaggi di programmazione html, css, c++, c, Java, php, Query e MySQL. Oltre ai linguaggi di programmazione ho acquisito competenze nel campo dei sistemi e nella logica informatica. Ho anche avuto l'opportunità di imparare ad assemblare computer e a modificare video e foto.",
    "it_work_projects": "Lavori IT e Progetti",
    "github_profile": "Profilo GitHub",
    "check_repositories": "Dai un'occhiata ai miei repository di codice e ai miei contributi open source:",
    "technical_skills": "Competenze Tecniche",
    "main_programming_languages": "Linguaggi di programmazione principali",
    "dart": "Dart",
    "java": "Java",
    "javascript": "JavaScript",
    "php": "Php",
    "html5": "HTML5",
    "css": "CSS",
    "bash": "Bash",
    "frameworks_libraries": "Frameworks e Librerie",
    "flutter": "Flutter",
    "react_js": "React JS",
    "ionic": "IONIC",
    "spring": "Spring",
    "tools_technologies": "Tools e Tecnologie",
    "android_studio": "Android Studio",
    "git_technologies": "Tecnologie Git",
    "vs_code": "VS Code",
    "wordpress": "Wordpress",
    "agile": "AGILE",
    "personal_projects": "Progetti personali",
    "fit_tracker": "FIT TRACKER (in corso)",
    "fit_tracker_desc": "App per smartphone per la palestra e le attività di benessere",
    "documenti": "Documenti",
    "draw_io": "Draw.io",
    "under_works": "LAVORI IN CORSO",
    "my_curriculum_vitae": "MyCurriculumVitaeSV",
    "curriculum_desc": "Piccolo progetto che mostra il mio CV come un sito",
    "certifications": "Certificati",
    "ionic_react_cert": "Ionic React: Cross-Platform Mobile Development with Ionic",
    "udemy": "Udemy",
    "cert_date_may_2023": "Maggio 2023",
    "ionic_cert_desc": "Certificato di un corso Udemy su Ionic React per imparare lo sviluppo per dispositivi mobile con Ionic. ID: UC-ade73744-93f4-4c87-9fb6-c1e6a9e48319",
    "business_english": "Business English Certificate",
    "adecco": "Adecco",
    "cert_date_july_2024": "Luglio 2024",
    "digital_transformation": "Digital Transformation Certificate",
    "cert_date_september_2024": "Settembre 2024",
    "work_experience": "Esperienze Lavorative",
    "software_developer": "Software Developer",
    "advanced_microwave": "Advanced Microwave Engeneering S.R.L.",
    "experience_date_06_2024": "06/2024 - Presente",
    "exp_software_dev_desc": "All'interno dell'azienda ricopro il ruolo di sviluppatore e tester di software. Nello specifico, ho contribuito ad apportare modifiche e aggiornamenti, ma anche ad avviare la creazione di applicazioni finalizzate alla sicurezza sul lavoro. Infatti, l'obiettivo comune dell'azienda è quello di sviluppare sistemi per la sicurezza dei lavoratori all'interno di luoghi di lavoro come cantieri edili o grandi magazzini.",
    "exp_technical_part": "Parte tecnica:",
    "exp_software_dev_technical": "Sviluppo software con Java e Flutter e utilizzo di Android Studio per lo sviluppo e la modifica di applicazioni Android. Fase di test in Java utilizzando l'ambiente di test NetBeans.",
    "jr_software_developer": "Jr Software Developer",
    "softec_spa": "Softec S.P.A.",
    "experience_date_09_2023": "09/2023 - 02/2024",
    "exp_internship_learned": "Durante lo stage ho appreso:",
    "exp_problem_solving": "Metodi di Problem Solving per risolvere query.",
    "exp_new_languages": "Nuovi linguaggi di programmazione come PHP e WordPress con studio approfondito di JavaScript, HTML5 e CSS.",
    "exp_team_working": "Capacità di lavorare in gruppo e di lavorare sotto pressione.",
    "exp_smart_working": "Attitudine allo Smart-Working",
    "jr_frontend_developer": "Jr Front-End Developer",
    "omnia_group": "Omnia Group S.R.L.",
    "experience_date_11_2022": "11/2022 - 05/2023",
    "exp_frontend_desc": "Durante il tirocinio ho avuto l'opportunità di interagire e contribuire allo sviluppo di interfacce utente e applicazioni web sul lato Front-End, occupandomi della creazione di tutti i moduli di registrazione degli utenti e distinguendo tra utenti base e utenti business; ho anche sviluppato le interfacce utente post-login, differenziandole principalmente in due parti: una prima parte che corrisponde al lato utente base ed è l'interfaccia cliente, una seconda parte che corrisponde al lato business ed è l'interfaccia dedicata alle aziende. Inoltre, anche se in misura minore, ho imparato l'implementazione di uno smart contract e il suo utilizzo in modo che possa essere reso utilizzabile all'interno dell'applicazione web sviluppata.",
    "exp_documentation": "Ho anche imparato come eseguire alcune operazioni di documentazione relative a un progetto, come la creazione di diagrammi di sequenza, l'uso dell'UML e la stesura di una descrizione di alcune parti del progetto.",
    "exp_additional_skills": "Oltre ai linguaggi di programmazione, ho potuto migliorare le mie competenze personali, come quelle relative al lavoro di squadra e allo smart working, nonché le mie capacità caratteriali, quali la concentrazione, la conformità, la serietà nei progetti di lavoro e, più in generale, la mia crescita personale e il mio livello di inglese scritto e orale.",
    "exp_skills_list": "Skills: Front-end Development · Web Design · Team Working· CSS · HTML · Sequence diagram · Uml · Web Development · Typescript · Solidity · Ionic · React.js · JavaScript",
    "additional_experience": "Esperienze aggiungtive",
    "receptionist": "Receptionist",
    "hotel_mia_cara": "Hotel Mia Cara",
    "experience_date_03_2024": "[03/2024 - 06/2024] - Hotel Mia Cara",
    "exp_receptionist_desc": "Ho svolto il lavoro di receptionist in un hotel nel centro di Firenze, lavorando principalmente su due turni, pomeridiano e notturno. Lavoro svolto durante un corso in JAVA per migliorare le mie conoscenze, corso organizzato da Adecco.",
    "varano-description": "Varano Brand è più di un marchio: è un'identità visiva che unisce stile, ricerca e carattere. Specializzati nella creazione di capi e prodotti che raccontano il Varano in tutti i luoghi possibili, puntiamo su qualità, autenticità e un design che lascia il segno, sempre mantenendo come punto cardine la sostenibilità ambientale e l'ecologia. Siamo dove la creatività incontra la natura, siamo Varano Brand.",
    "petsittingsite": "Pet Sitting Website",
    "petsitting_desc": "Sito web realizzato per l'attività di pet sitting di Letizia & Samuel. In questo sito puoi trovare tutte le informazioni sul servizio offerto e prenotare direttamente il tuo posto o servizio semplicemente controllando il calendario delle disponibilità."
}